# 1. შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია, რომელიც
# მიიღებს რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს.
#
# int_list = [10,20,30,40]
#
# def my_func(x: int):
#     int_list.append(x)
#
# my_func(100)
# print(int_list)
#
# 2. დაწერეთ პითნის ფუნქცია რომელიც პარამეტრად იღებს რიცხვების სიას (ლისტს) და აბრუნებს რიცხვების
# ჯამს. პარამეტრად უნდა მიიღოს შემდეგი სია [100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10].
#
# def my_func(my_list: list):
#     total = sum(my_list)
#     return total
#
# my_lst=[100, 20, 30, 50, 5323, 3321, 22, 56, 700, 90, 10]
#
# print(my_func(my_lst))
#
# 3. შექმენით გლობალური ცვლადი gl_str = "Global" და დაწერეთ პითონის ფუნქცია რომელიც ქმნის
# ლოკალურ ცვლადს იგივე სახელით რაც გლობალურ ცვლადს აქვს  (gl_str) და აბრუნებს ლოკალური ცვლადის
# მნიშვნელობას.
#
# gl_str = "Global"
#
# def my_func():
#     gl_str = "Local"
#     return gl_str
#
# print(my_func())
#
#
# 4. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და
# დააბრუნებს  ციფრების ჯამს (მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15.
# რადგან 1+2+3+4+5 უდრის 15-ს).
#
# def my_rec_func(num: int):
#     if num < 10:
#         return num
#     return num % 10 + my_rec_func(num // 10)
#
# print(my_rec_func(12345))
#
# 5. რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და
# დააბრუნებს მის შებრუნებულ (revers) სტრიქონს (მაგალითად  input: Hello   Output: olleH)
#
# def my_rec_func(str: str):
#     if len(str) == 0:
#         return str
#     return str[-1] + my_rec_func(str[:-1])
#
# print(my_rec_func("hello"))

